src/Catalogs/Files.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Files</Name>
			<Comment>Files in folders</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Comment>Author - User, who added the file</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileFolders</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Comment>Date of adding file to the database</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Comment>Encrypted</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Comment>Index of an icon, corresponding to the file extension, to be displayed in the list</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Details</Name>
					<Comment>File description</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Signed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileName</Name>
					<Comment>Full description (of length of up to 256 chars)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LockedBy</Name>
					<Comment>User, locked file for edit</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Comment>Text, extracted from file - for full-text search</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersion</Name>
					<Comment>Active version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionAuthor</Name>
					<Comment>Author - User, who created the version</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionDateCreated</Name>
					<Comment>Version create date</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionFilePath</Name>
					<Comment>Additional path to a file on drive (in case if FileStorageType - "on drive")</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionSize</Name>
					<Comment>Size of versions' file</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionExtension</Name>
					<Comment>Version file extension</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentVersionVolume</Name>
					<Comment>Ref to volume (if FileStorageType = 'on drive' )</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StoreVersions</Name>
					<Comment>Store versions - if False, file always has single Active version</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalDataAndAttributes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>EncryptionCertificates</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Presentation</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Files/Forms/LocalCashFilesList/Ext/Form/Module.bsl
&AtClient
Procedure FillFileListInForm()
	FileOperationsClient.InitializeWorkingDirectoryPath();
	LocalFilesCachePath = FileOperationsSecondUseClient.GetFileOperationsPersonalSettings().LocalFilesCachePath;
	
	FileList.Clear();
	
	For Each Row In ListOfFileValuesInRegister Do
		
		FullPath = LocalFilesCachePath + Row.Value.PartialPath;
		File = New File(FullPath);
		If File.Exist() Then
			NewRow = FileList.Add();
			
			FileInCacheDate = Row.Value.DateModifiedUniversal;
			CommonUseClient.ConvertSummerTimeToCurrentTime(FileInCacheDate);
			NewRow.FileModificationDate = FileInCacheDate;
			
			NewRow.FileName 		= Row.Value.Description;
			NewRow.PictureIndex  	= Row.Value.PictureIndex;
			NewRow.Size 			= Row.Value.Size;
			NewRow.Version 			= Row.Value.Ref;
			NewRow.LockedBy 		= Row.Value.LockedBy;
			NewRow.ForEdit 			= Not Row.Value.ForRead;
		EndIf;
	
	EndDo; 	
	
EndProcedure

&AtClient
Procedure OnOpen(Cancellation)
	FillFileListInForm();
EndProcedure

&AtClient
Procedure DeleteByRef(RefForDelete)
	ItemCount = FileList.Count();
	
	For Number = 0 To ItemCount - 1 Do
		String 	= FileList[Number];
		Ref 	= String.Version;
		If Ref = RefForDelete Then
			FileList.Delete(Number);
			Return;
		EndIf;
	EndDo;
EndProcedure

&AtClient
Procedure ReleaseExecute()
	RefsArray = New Array;
	For Each Item In Items.FileList.SelectedRows Do
		RowData = Items.FileList.RowData(Item);
		Ref = RowData.Version;
		RefsArray.Add(Ref);
	EndDo;
	
	For Each Ref In RefsArray Do
		FileData = FileOperations.GetFileData(Undefined, Ref);
		
		// Check possibility to release the file
		ErrorString = "";
		If Not FileOperationsClient.CanUnlockFile(FileData.Ref, FileData.LockedByCurrentUser, FileData.LockedBy, ErrorString) Then
			DoMessageBox(ErrorString);
			Continue;
		EndIf;
		
		FileOperationsClient.UnlockFile(FileData.Ref);
	EndDo;
	
	FillFileList();
	FillFileListInForm();
EndProcedure

&AtServer
Procedure FillFileList()
	
	ListOfFilesInRegister = FileOperations.ListOfFilesInRegister();
	ListOfFileValuesInRegister.Clear();
	
	For Each Row In ListOfFilesInRegister Do
		ListOfFileValuesInRegister.Add(Row);
	EndDo; 	

EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	FillFileList();
EndProcedure

&AtClient
Procedure OpenFileDirectoryExecute()
	If Items.FileList.CurrentData <> Undefined Then
		Ref = Items.FileList.CurrentData.Version;
		FileData = FileOperations.GetFileData(Undefined, Ref);
		FileOperationsClient.FileDir(FileData);
	EndIf;
EndProcedure

&AtClient
Procedure DeleteFromFilesLocalCache(Command)
	RefsArray = New Array;
	For Each CycleNumber In Items.FileList.SelectedRows Do
		RowData = Items.FileList.RowData(CycleNumber);
		Ref = RowData.Version;
		If RowData.ForEdit = False Then // If is not locked by current user
			RefsArray.Add(Ref);
		EndIf;
	EndDo;
	
	For Each Ref In RefsArray Do
		FileFunctionsClient.DeleteFileFromWorkingDirectory(Ref);
		DeleteByRef(Ref);
	EndDo;
	
	Items.FileList.Refresh();
EndProcedure

&AtClient
Procedure EndEdit(Command)
	If Items.FileList.CurrentData <> Undefined Then
		Ref = Items.FileList.CurrentData.Version;
		FileData = FileOperations.GetFileData(Undefined, Ref);
		FileOperationsCommands.EndEdit(FileData.Ref, Uuid);
		FillFileList();
		FillFileListInForm();
	EndIf;
EndProcedure
